; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v2)
		(pred_1 ?v8)
		(pred_6 ?v5)
		(pred_5 ?v5)
		(pred_4 ?v8 ?v5)
		(pred_3)
		(pred_2 ?v8))

   (:action op_1
       :parameters  (?v1 ?v6)
       :precondition (and (not-eq ?v1 ?v6) 
                          (pred_6 ?v1) (pred_6 ?v6) (pred_5 ?v1))
       :effect (and  (pred_5 ?v6)
		     (not (pred_5 ?v1))))


   (:action op_3
       :parameters (?v7 ?v3)
       :precondition  (and  (pred_1 ?v7) (pred_6 ?v3)
			    (pred_4 ?v7 ?v3) (pred_5 ?v3) (pred_3))
       :effect (and (pred_2 ?v7)
		    (not (pred_4 ?v7 ?v3)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v7  ?v3)
       :precondition  (and  (pred_1 ?v7) (pred_6 ?v3)
			    (pred_2 ?v7) (pred_5 ?v3))
       :effect (and (pred_4 ?v7 ?v3)
		    (pred_3)
		    (not (pred_2 ?v7)))))

; problem
(define (problem ferry-l4-c2)
(:domain ferry)
(:objects obj_02 obj_06 obj_04 obj_05 
          obj_03 obj_01 
)
(:init
(pred_6 obj_02)
(pred_6 obj_06)
(pred_6 obj_04)
(pred_6 obj_05)
(pred_1 obj_03)
(pred_1 obj_01)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(pred_3)
(pred_4 obj_03 obj_05)
(pred_4 obj_01 obj_02)
(pred_5 obj_02)
)
(:goal
(and
(pred_4 obj_03 obj_04)
(pred_4 obj_01 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_03 obj_04) (pred_5 obj_06))
    (sometime-before  (pred_4 obj_01 obj_06) (pred_5 obj_04))
  )
)
)

; plan
1. (op_3 obj_01 obj_02)
   deleted: (pred_4 obj_01 obj_02) (pred_3)
   added: (pred_2 obj_01)
   goals met: 0 of 2
2. (op_1 obj_02 obj_04)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_04)
   goals met: 0 of 2
3. (op_1 obj_04 obj_06)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_06)
   goals met: 0 of 2
4. (op_2 obj_01 obj_06)
   deleted: (pred_2 obj_01)
   added: (pred_4 obj_01 obj_06) (pred_3)
   goals met: 1 of 2
5. (op_1 obj_06 obj_05)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_05)
   goals met: 1 of 2
6. (op_3 obj_03 obj_05)
   deleted: (pred_4 obj_03 obj_05) (pred_3)
   added: (pred_2 obj_03)
   goals met: 1 of 2
7. (op_1 obj_05 obj_04)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_04)
   goals met: 1 of 2
8. (op_2 obj_03 obj_04)
   deleted: (pred_2 obj_03)
   added: (pred_4 obj_03 obj_04) (pred_3)
   goals met: 2 of 2
